## Replace missing Data

In [3]:
import numpy as np;
import pandas as pd;

In [4]:
df = pd.DataFrame({'A' : [1,2,np.nan], 'B' : [5,np.nan,np.nan] , 'C' : [1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
#ลบ col ที่มีค่า null ใส่ inplace ด้วย 
df.dropna()

     A    B  C
0  1.0  5.0  1

In [7]:
# fill na ด้วยค่า Fill
df.fillna(value = 'Fill')

      A     B  C
0     1     5  1
1     2  Fill  2
2  Fill  Fill  3

In [10]:
# fill na ด้วยค่า mean ของ Col A
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group

In [7]:
df2 = pd.DataFrame({'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'] , 
                    'Person' : ['Sam','Charlie','Amy','Vanessa','Carl','Sarah']
                   ,'Sales' : [200,100,340,124,243,350]})

In [12]:
df2

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    100
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [18]:
# ดูค่ามางสถิติทั้งหมด
df2.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  150.0   70.710678  100.0  125.00  150.0  175.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [23]:
# ดูค่าทางสถิติของแต่ละ col 
df2.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [6]:
df.isnull().sum()

A    1
B    2
C    0
dtype: int64